---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTableIterator.IsDone
source: html/a95bd17b-d1b6-c3da-def1-0b1f06477e0f.htm
---
# Autodesk.Revit.DB.ExportLineweightTableIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.